{
  "_name_or_path": "/content/drive/MyDrive/intent_classification/fine_tuned_distilled_bert",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "asking date",
    "1": "asking time",
    "2": "asking weather",
    "3": "click photo",
    "4": "covid cases",
    "5": "download youtube video",
    "6": "goodbye",
    "7": "greet and hello hi kind of things, general check in",
    "8": "i am bored",
    "9": "open website",
    "10": "places near me",
    "11": "play games",
    "12": "play on youtube",
    "13": "send email",
    "14": "send whatsapp message",
    "15": "take screenshot",
    "16": "tell me about",
    "17": "tell me joke",
    "18": "tell me news",
    "19": "volume control",
    "20": "what can you do"
  },
  "initializer_range": 0.02,
  "label2id": {
    "asking date": 0,
    "asking time": 1,
    "asking weather": 2,
    "click photo": 3,
    "covid cases": 4,
    "download youtube video": 5,
    "goodbye": 6,
    "greet and hello hi kind of things, general check in": 7,
    "i am bored": 8,
    "open website": 9,
    "places near me": 10,
    "play games": 11,
    "play on youtube": 12,
    "send email": 13,
    "send whatsapp message": 14,
    "take screenshot": 15,
    "tell me about": 16,
    "tell me joke": 17,
    "tell me news": 18,
    "volume control": 19,
    "what can you do": 20
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vocab_size": 30522
}
